Revit 2026 API
ItemFactoryBase.NewDimension(View, Line, ReferenceArray) Method
 Creates a new linear dimension object using the default dimension style.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)
Syntax
public Dimension NewDimension(
	View view,
	Line line,
	ReferenceArray references
)
Public Function NewDimension (
	view As View,
	line As Line,
	references As ReferenceArray
) As Dimension
public:
Dimension^ NewDimension(
	View^ view,
	Line^ line,
	ReferenceArray^ references
)
member NewDimension :
        view : View *
        line : Line *
        references : ReferenceArray -> Dimension
Parameters
view View
 The view in which the dimension is to be visible. The view must be null if the document is in [!:Autodesk::Revit::DB::SketchEditScope].
line Line
 The line drawn for the dimension.
references ReferenceArray
 An array of geometric references to which the dimension is to be bound.
Return Value
Dimension
 If successful a new dimension object, otherwise null.
Exceptions
Exception | Condition
ArgumentException | Thrown when references are not geometric references.
Remarks
 The currently user set default style is used for the created dimension.
See Also
Reference
ItemFactoryBase Class
NewDimension Overload
Autodesk.Revit.Creation Namespace